{
  "architectures": [
    "TrellisForCausalLM"
  ],
  "model_type": "trellis",
  "vocab_size": 128,
  "hidden_size": 64,
  "intermediate_size": 128,
  "num_hidden_layers": 2,
  "num_attention_heads": 4,
  "num_key_value_heads": 2,
  "head_dim": 16,
  "kv_lora_rank": 16,
  "q_lora_rank": 16,
  "qk_nope_head_dim": 8,
  "qk_rope_head_dim": 8,
  "v_head_dim": 16,
  "num_experts": 1,
  "num_experts_per_tok": 1,
  "max_position_embeddings": 512,
  "rms_norm_eps": 1e-06,
  "torch_dtype": "float32",
  "rope_theta": 10000.0,
  "quantization_bits": 4,
  "first_moe_layer": 2
}