{
  "metadata": {
    "format": "trellis_v3",
    "total_size": 45968
  },
  "weight_map": {
    "model__layers__0__self_attn__q_a_proj__indices": "model-00001-of-00001.safetensors",
    "model__layers__0__self_attn__q_a_proj__scales": "model-00001-of-00001.safetensors",
    "model__layers__0__self_attn__q_a_proj__su": "model-00001-of-00001.safetensors",
    "model__layers__0__self_attn__q_a_proj__sv": "model-00001-of-00001.safetensors",
    "model__layers__0__self_attn__q_b_proj__indices": "model-00001-of-00001.safetensors",
    "model__layers__0__self_attn__q_b_proj__scales": "model-00001-of-00001.safetensors",
    "model__layers__0__self_attn__q_b_proj__su": "model-00001-of-00001.safetensors",
    "model__layers__0__self_attn__q_b_proj__sv": "model-00001-of-00001.safetensors",
    "model__layers__0__self_attn__kv_a_proj_with_mqa__indices": "model-00001-of-00001.safetensors",
    "model__layers__0__self_attn__kv_a_proj_with_mqa__scales": "model-00001-of-00001.safetensors",
    "model__layers__0__self_attn__kv_a_proj_with_mqa__su": "model-00001-of-00001.safetensors",
    "model__layers__0__self_attn__kv_a_proj_with_mqa__sv": "model-00001-of-00001.safetensors",
    "model__layers__0__self_attn__kv_b_proj__indices": "model-00001-of-00001.safetensors",
    "model__layers__0__self_attn__kv_b_proj__scales": "model-00001-of-00001.safetensors",
    "model__layers__0__self_attn__kv_b_proj__su": "model-00001-of-00001.safetensors",
    "model__layers__0__self_attn__kv_b_proj__sv": "model-00001-of-00001.safetensors",
    "model__layers__0__self_attn__o_proj__indices": "model-00001-of-00001.safetensors",
    "model__layers__0__self_attn__o_proj__scales": "model-00001-of-00001.safetensors",
    "model__layers__0__self_attn__o_proj__su": "model-00001-of-00001.safetensors",
    "model__layers__0__self_attn__o_proj__sv": "model-00001-of-00001.safetensors",
    "model__layers__0__mlp__gate_proj__indices": "model-00001-of-00001.safetensors",
    "model__layers__0__mlp__gate_proj__scales": "model-00001-of-00001.safetensors",
    "model__layers__0__mlp__gate_proj__su": "model-00001-of-00001.safetensors",
    "model__layers__0__mlp__gate_proj__sv": "model-00001-of-00001.safetensors",
    "model__layers__0__mlp__up_proj__indices": "model-00001-of-00001.safetensors",
    "model__layers__0__mlp__up_proj__scales": "model-00001-of-00001.safetensors",
    "model__layers__0__mlp__up_proj__su": "model-00001-of-00001.safetensors",
    "model__layers__0__mlp__up_proj__sv": "model-00001-of-00001.safetensors",
    "model__layers__0__mlp__down_proj__indices": "model-00001-of-00001.safetensors",
    "model__layers__0__mlp__down_proj__scales": "model-00001-of-00001.safetensors",
    "model__layers__0__mlp__down_proj__su": "model-00001-of-00001.safetensors",
    "model__layers__0__mlp__down_proj__sv": "model-00001-of-00001.safetensors",
    "model__layers__1__self_attn__q_a_proj__indices": "model-00001-of-00001.safetensors",
    "model__layers__1__self_attn__q_a_proj__scales": "model-00001-of-00001.safetensors",
    "model__layers__1__self_attn__q_a_proj__su": "model-00001-of-00001.safetensors",
    "model__layers__1__self_attn__q_a_proj__sv": "model-00001-of-00001.safetensors",
    "model__layers__1__self_attn__q_b_proj__indices": "model-00001-of-00001.safetensors",
    "model__layers__1__self_attn__q_b_proj__scales": "model-00001-of-00001.safetensors",
    "model__layers__1__self_attn__q_b_proj__su": "model-00001-of-00001.safetensors",
    "model__layers__1__self_attn__q_b_proj__sv": "model-00001-of-00001.safetensors",
    "model__layers__1__self_attn__kv_a_proj_with_mqa__indices": "model-00001-of-00001.safetensors",
    "model__layers__1__self_attn__kv_a_proj_with_mqa__scales": "model-00001-of-00001.safetensors",
    "model__layers__1__self_attn__kv_a_proj_with_mqa__su": "model-00001-of-00001.safetensors",
    "model__layers__1__self_attn__kv_a_proj_with_mqa__sv": "model-00001-of-00001.safetensors",
    "model__layers__1__self_attn__kv_b_proj__indices": "model-00001-of-00001.safetensors",
    "model__layers__1__self_attn__kv_b_proj__scales": "model-00001-of-00001.safetensors",
    "model__layers__1__self_attn__kv_b_proj__su": "model-00001-of-00001.safetensors",
    "model__layers__1__self_attn__kv_b_proj__sv": "model-00001-of-00001.safetensors",
    "model__layers__1__self_attn__o_proj__indices": "model-00001-of-00001.safetensors",
    "model__layers__1__self_attn__o_proj__scales": "model-00001-of-00001.safetensors",
    "model__layers__1__self_attn__o_proj__su": "model-00001-of-00001.safetensors",
    "model__layers__1__self_attn__o_proj__sv": "model-00001-of-00001.safetensors",
    "model__layers__1__mlp__gate_proj__indices": "model-00001-of-00001.safetensors",
    "model__layers__1__mlp__gate_proj__scales": "model-00001-of-00001.safetensors",
    "model__layers__1__mlp__gate_proj__su": "model-00001-of-00001.safetensors",
    "model__layers__1__mlp__gate_proj__sv": "model-00001-of-00001.safetensors",
    "model__layers__1__mlp__up_proj__indices": "model-00001-of-00001.safetensors",
    "model__layers__1__mlp__up_proj__scales": "model-00001-of-00001.safetensors",
    "model__layers__1__mlp__up_proj__su": "model-00001-of-00001.safetensors",
    "model__layers__1__mlp__up_proj__sv": "model-00001-of-00001.safetensors",
    "model__layers__1__mlp__down_proj__indices": "model-00001-of-00001.safetensors",
    "model__layers__1__mlp__down_proj__scales": "model-00001-of-00001.safetensors",
    "model__layers__1__mlp__down_proj__su": "model-00001-of-00001.safetensors",
    "model__layers__1__mlp__down_proj__sv": "model-00001-of-00001.safetensors"
  }
}